<a href="https://colab.research.google.com/github/truongthuanr/self-learning-project/blob/main/03_MallCustomer.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Information

Dataset: https://www.kaggle.com/shwetabh123/mall-customers

Get the customer data include following feature: 
* Customer ID
* Customer Gender
* Customer Age
* Annual income of customer
* Spending score of the customer

Problem: Analyzing and grouping customer for develop business strategy

# Import Data

In [4]:
import pandas as pd

In [5]:
url = "https://raw.githubusercontent.com/truongthuanr/self-learning-project/main/dataset/mall-customer/Mall_Customers.csv"

In [7]:
df = pd.read_csv(url)

In [8]:
df.head()

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

# Exploratory Data Analysis

In [9]:
df.describe()

       CustomerID         Age  Annual Income (k$)  Spending Score (1-100)
count  200.000000  200.000000          200.000000              200.000000
mean   100.500000   38.850000           60.560000               50.200000
std     57.879185   13.969007           26.264721               25.823522
min      1.000000   18.000000           15.000000                1.000000
25%     50.750000   28.750000           41.500000               34.750000
50%    100.500000   36.000000           61.500000               50.000000
75%    150.250000   49.000000           78.000000               73.000000
max    200.000000   70.000000          137.000000               99.000000

In [11]:
df.shape

(200, 5)

Check if is there any null data?

In [13]:
df.isna().sum()

CustomerID                0
Genre                     0
Age                       0
Annual Income (k$)        0
Spending Score (1-100)    0
dtype: int64